experimentos/EXP-002-k6-api-activities/logs/exploratorio-get/baseline-run.txt

         /\      Grafana   /ÔÇ¥ÔÇ¥/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ÔÇ¥ÔÇ¥\ 
  /          \   |   (  |  (ÔÇ¥)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: .\baseline-activities.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 25 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
default   [  88% ] 1 VUs  00m00.1s/10m0s  22/25 shared iters


  Ôûê TOTAL RESULTS 

    checks_total.......: 26      25.649138/s
    checks_succeeded...: 100.00% 26 out of 26
    checks_failed......: 0.00%   0 out of 26

    Ô£ô login devuelve 200
    Ô£ô activities devuelve 200

    HTTP
    http_req_duration..............: avg=38.38ms min=3.69ms med=4.88ms max=876.15ms p(90)=5.88ms p(95)=5.93ms
      { expected_response:true }...: avg=38.38ms min=3.69ms med=4.88ms max=876.15ms p(90)=5.88ms p(95)=5.93ms
    http_req_failed................: 0.00%  0 out of 26
    http_reqs......................: 26     25.649138/s

    EXECUTION
    iteration_duration.............: avg=4.91ms  min=3.95ms med=4.86ms max=6.49ms   p(90)=5.78ms p(95)=5.9ms 
    iterations.....................: 25     24.662632/s
    vus............................: 1      min=1       max=1
    vus_max........................: 1      min=1       max=1

    NETWORK
    data_received..................: 8.2 kB 8.1 kB/s
    data_sent......................: 10 kB  10 kB/s



running (00m01.0s), 0/1 VUs, 25 complete and 0 interrupted iterations
default Ô£ô [ 100% ] 1 VUs  00m00.1s/10m0s  25/25 shared iters